"""
==================================
文件名: python_basic583
作者:    星光梁朝伟
时间:   2022/5/15-14:13
==================================
"""

"""
循环嵌套:外层循环体内又包含了一个循环
"""

print(3)
print(3, end=' ')
print()

print('===' * 50)

# 怎么打印一个四行五列的长方形
# *****
# *****
# *****
# *****

for i in range(4):  # 0123
    print('*****')

print('===' * 50)

# 要求只可以用单个'*' 去打印四行五列的长方形
# for j in range(5):
#     print('*', end='')
# print()

for i in range(4):
    for j in range(5):
        print('*', end='')
    print()

print('===' * 50)

# 打印一个直角三角形
# *
# **
# ***
# ****

# 直角三角形一共有四行,所以外循环循环4次
# 内循环第一次打印一个星 * , 第二次循环打印两个星 ** ,第三次循环打印三个星 *** ,第四次循环打印四个星 ****

for i in range(4):  # 外循环循环四次 i = 0,1,2,3
    for j in range(i + 1):  # 内循环 j = 0,01,012,0123
        print('*', end='')
        # *
        # **
        # ***
        # ****

    print()

print('===' * 50)

# 打印九九乘法口诀表
# 1*1=1
# 1*2=2 2*2=4
# 1*3=3 2*3=6 3*3=9
# 1*4=4 2*4=8 3*4=12 4*4=16
# ......

for i in range(9):  # 外循环 i = 0,1,2,3,4,5,6,7,8
    for j in range(i + 1):  # 内循环 j = 0,01,012,0123,01234......012345678
        print('{}*{}={} '.format(j + 1, i + 1, (j + 1) * (i + 1)), end='')
        # 1*1=1
        # 1*2=2 2+2=4
        # 1*3=3 2*3=6 3*3=9
        # 1*4=4 2*4=8 3*4=12 4*4=16
        # ......
    print()
