"""
==================================
文件名: python_basic54
作者:    星光梁朝伟
时间:   2022/5/15-15:41
==================================
"""

"""
冒泡排序
"""

# 数据交换,a和b的值进行交换
a = 1
b = 2

# t = a
# a = b
# b = t

a, b = b, a

print('a的值:', a)  # a的值: 2
print('b的值:', b)  # b的值: 1

# 有如下列表,我们怎么互换 下标0 和 下标1 位置的成员
list1 = [33, 20, 16, 99, 2]

# t = list1[0]
# list1[0] = list1[1]
# list1[1] = t

list1[0], list1[1] = list1[1], list1[0]

print(list1)  # [20, 33, 16, 99, 2]

print('===' * 50)

# 确定了列表中一个数的位置
list1 = [33, 20, 16, 99, 2]

for j in range(len(list1) - 1):  # 如果想要确定一个序列中最大值或最小值,那么至少需要比较这个序列长度减一次 j = 0,1,2,3
    if list1[j] > list1[j + 1]:  # 如果前面的值比后面的值大,那么交换位置
        # list1[0] > list1[1]  条件成立所以交换位置: [20, 33, 16, 99, 2]
        # list1[1] > list1[2]  条件成立所以交换位置: [20, 16, 33, 99, 2]
        # list1[2] > list1[3]  条件不成立,不交换位置: [20, 16, 33, 99, 2]
        # list1[3] > list1[4]  条件成立所以交换位置: [20, 16, 33, 2, 99]
        list1[j], list1[j + 1] = list1[j + 1], list1[j]

print(list1)  # [20, 16, 33, 2, 99]

print('===' * 50)

list1 = [33, 20, 16, 99, 2]

# 第一次外循环: [20, 33, 16, 99, 2] [20, 16, 33, 99, 2] [20, 16, 33, 99, 2] [20, 16, 33, 2, 99]
# 第二次外循环: [16, 20, 33, 2, 99] [16, 20, 33, 2, 99] [16, 20, 2, 33, 99] [16, 20, 2, 33, 99]
# 第三次外循环: [16, 20, 2, 33, 99] [16, 2, 20, 33, 99] [16, 2, 20, 33, 99] [16, 2, 20, 33, 99]
# 第四次外循环: [2, 16, 20, 33, 99] [2, 16, 20, 33, 99] [2, 16, 20, 33, 99] [2, 16, 20, 33, 99]

# 想要这个列表排序,需要确定几个数的位置?
for i in range(len(list1) - 1):  # 外循环,负责有多少个数需要确定位置 i = 0,1,2,3
    for j in range(len(list1) - 1 - i):  # 内循环循环完成一次确定一个数的位置 j = 0123
        if list1[j] > list1[j + 1]:
            list1[j], list1[j + 1] = list1[j + 1], list1[j]

print(list1)  # [2, 16, 20, 33, 99]
