"""
==================================
文件名: python_basic71
作者:    Liu
时间:   2022/5/29-10:07
==================================
"""
"""
组包 装包   就是把多个数据放在一个元组当中
拆包 解包   把一组数据进行拆分  比如 列表 元组 字典  拆分成单个数据
"""

# 自动组包  任意无符号对象以逗号隔开  会自动组包成一个元组
a = 1, 2, 3, 4
print(a)
print(type(a))
#
b = '老刘', '老徐', '心凌男孩'
# print(b, type(b))

# 自动拆包  注意点 变量的个数要与被拆包对象中元素个数一致

# b1, b2, b3 = b
# print(b1)
# print(b2)
# print(b3)

# 手动拆包  *
# print(*b)
# a1, *a2 = b
# print(a1)
# print(a2)
#
# *c1, c2 = b
# print(c2)
# print(c1)

# 对字典的操作 默认时操作键
dict1 = {'心凌男孩': '30', '性别': '男', '户籍': '湖北'}
d1, d2, d3 = dict1.items()
print(d1)
print(d2)
print(d3)
print()
