"""
============================
   Author: Lee
   date  : 2022/5/22 - 15:32
=============================
"""

from copy import copy, deepcopy

"""
python的深拷贝和浅拷贝的区别
浅拷贝: 当原容器对象中可变对象发生变化,拷贝得到的对象也会发生变化
使用方法: B = copy.copy(A)

深拷贝: 是完全拷贝出了一个独立的对象,无论是可变类型还是不可变类型,拷贝得到的对象和原对象互不影响
使用方法: B = copy.deepcopy(A)
"""

# 深拷贝
list1 = ['a', 'b', 'c', 1, 2, 3, [4, 5, 6]]

list2 = deepcopy(list1)
print('list1的物理地址是:', id(list1))  # list1的物理地址是: 2138025390728
print('list2的物理地址是:', id(list2))  # list2的物理地址是: 2138025532168

# 深拷贝赋值出完全独立的新对象
list1[-1][0] = 444
print('list1的值是:', list1)  # list1的值是: ['a', 'b', 'c', 1, 2, 3, [444, 5, 6]]
print('list2的值是:', list2)  # list2的值是: ['a', 'b', 'c', 1, 2, 3, [4, 5, 6]]

list1[0] = '小花'
print('list1的值是:', list1)  # list1的值是: ['小花', 'b', 'c', 1, 2, 3, [444, 5, 6]]
print('list2的值是:', list2)  # list2的值是: ['a', 'b', 'c', 1, 2, 3, [4, 5, 6]]

print('===' * 50)

# 浅拷贝
list1 = ['a', 'b', 'c', 1, 2, 3, [4, 5, 6]]

list2 = copy(list1)
print('list1的物理地址是:', id(list1))  # list1的物理地址是: 2919339502280
print('list2的物理地址是:', id(list2))  # list2的物理地址是: 2919339357192

list1[-1][0] = 666
# 浅拷贝对于原拷贝对象中的可变类型没有真正的拷贝,还指向原来的可变类型地址,所以可变类型发生变化,会相互影响
print('list1的值是:', list1)  # list1的值是: ['a', 'b', 'c', 1, 2, 3, [666, 5, 6]]
print('list2的值是:', list2)  # list2的值是: ['a', 'b', 'c', 1, 2, 3, [666, 5, 6]]

list1[0] = '小美'
# 浅拷贝对于原拷贝对象中的不可变类型,是拷贝复制出了一个独立的对象,所以不可变类型不会相互影响
print('list1的值是:', list1)  # list1的值是: ['小美', 'b', 'c', 1, 2, 3, [666, 5, 6]]
print('list2的值是:', list2)  # list2的值是: ['a', 'b', 'c', 1, 2, 3, [666, 5, 6]]
