"""
============================
   Author: Lee
   date  : 2022/5/22 - 14:06
=============================
"""

"""
python的数据类型: number数字/str字符串/list列表/tuple元组/set集合/dict字典

可变类型: 列表、集合、字典
不可变类型: 数字、字符串、元组

有序的: 字符串、列表、元组
无序的: 数字、集合、字典
"""

# 1.区分重新赋值和更改内容,查看变量内存地址的函数: id()
a = 100
a = 200  # 重新赋值

list1 = [1, 2, 3, 4, 5]
list1[0] = 999  # 这里是更改内容
print(list1)  # [999, 2, 3, 4, 5]

# 2.可变类型可以修改内容,内存地址不变,比如列表、集合、字典
list2 = ['小花', '小美', '小红', 1, 2, 3]
print('修改前的list2内存地址:', id(list2))  # 修改前的list2内存地址: 1808347156040

list2[0] = 'xiaohua'
list2.append('小黑')
del list2[-1]

print(list2)  # ['xiaohua', '小美', '小红', 1, 2, 3]
print('修改后的list2内存地址:', id(list2))  # 修改后的list2内存地址: 1808347156040

# 3.不可变类型不能修改内容
tup1 = (10, 20, 30, 40)
# tup1[0] = 999  # 元组不支持通过下标修改内容
print(tup1)  # (10, 20, 30, 40)
print('修改前的内存地址:', id(tup1))  # 修改前的内存地址: 3014798066696

tup1 += (50, 60, 70)
print(tup1)  # (10, 20, 30, 40, 50, 60, 70)
print('修改后的内存地址:', id(tup1))  # 修改后的内存地址: 3014796995600
