"""
==================================
文件名: python02
作者:    Liu
时间:   2022/6/26-15:25
==================================
"""

"""
继承: 子类继承父类,子类就可以使用父类的属性和方法。子类叫派生类,父类叫基类
继承的好处: 减少代码冗余,提高代码重用性(派生类一旦继承基类就可以使用基类的所有的属性和方法)
Java单继承,Python多继承
继承的语法: 在声明类的时候在类名之后使用(基类1,基类2,基类3...)
"""


class Animal:
    country = ''
    name = ''
    age = ''

    def eat(self):
        print('%s正在干饭~~' % self.name)


class Dog(Animal):  # Dog类继承了Animal
    def say(self):
        print('正在咆哮!!')


d1 = Dog()  # 新建了一个Dog类的实例对象d1
d1.name = '旺财'  # 调用父类的属性
d1.age = 5

d1.eat()  # 旺财正在干饭~~
d1.say()  # 正在咆哮!!
